{
  "sections": [
    {
      "title": "Addressing Core Challenges with Machine Learning",
      "section_id": "2. Addressing Core Challenges with Machine Learning",
      "subsections": [
        {
          "title": "Tackling Subject Variability",
          "section_id": "2.1 Tackling Subject Variability",
          "methods": [
            {
              "title": "Transfer Learning and Domain Adaptation",
              "section_id": "2.1.1 Transfer Learning and Domain Adaptation",
              "examples": [
                {
                  "reference": "Feng_X_2025",
                  "description": "Presents PASAN-CA, utilizing coordinate attention mechanisms and subdomain adaptation for cross-subject fatigue detection.",
                  "note": "Added for its advanced domain adaptation techniques, enhancing model generalization across subjects. Note: The reference year (2025) suggests this is a future work and might need to be considered for the scope of this review."
                }
              ]
            }
          ]
        },
        {
          "title": "Reducing the Number of EEG Channels",
          "section_id": "2.2 Reducing the Number of EEG Channels",
          "methods": [
            {
              "title": "Channel Selection Algorithms",
              "section_id": "2.2.1 Channel Selection Algorithms",
              "examples": [
                {
                  "reference": "Asl_N_2022",
                  "description": "Examines consumer-grade EEG headsets for practical drowsiness detection systems.",
                  "note": "Added for its focus on the practical application and usability of consumer-grade EEG headsets in real-world drowsiness detection systems."
                },
                {
                  "reference": "Eldeib_A_2016",
                  "description": "Develops a pBCI system for classifying drowsy and alert states using only a single EEG channel, enhancing practicality.",
                  "note": "Added for its contribution to practical, non-intrusive EEG-based fatigue detection systems with a focus on simplified hardware requirements."
                }
              ]
            }
          ]
        },
        {
          "title": "Enhancing Robustness and Generalization",
          "section_id": "2.4 Enhancing Robustness and Generalization",
          "methods": [
            {
              "title": "Data Augmentation Techniques",
              "section_id": "2.4.1 Data Augmentation Techniques",
              "examples": [
                {
                  "reference": "Cao_L_2024",
                  "description": "Suggests developing data augmentation techniques for multimodal data to improve model robustness.",
                  "note": "Added for its focus on addressing data scarcity through multimodal data augmentation, which is crucial for enhancing model robustness."
                },
                {
                  "reference": "Gao_D_2023_1",
                  "description": "Utilizes a fusion-separation mechanism and a specialized network architecture to handle the complexities and noise in EEG and ECG signals, indirectly addressing data scarcity by effectively using available data.",
                  "note": "Added for its indirect approach to addressing data scarcity by making efficient use of available EEG and ECG data through a fusion-separation mechanism."
                },
                {
                  "reference": "Hu_F_2024",
                  "description": "The paper does not explicitly mention data augmentation, but the use of advanced deep learning architectures like the proposed SACC-CapsNet could potentially benefit from data augmentation to enhance model robustness and generalization.",
                  "note": "Added for its potential use of data augmentation to enhance the robustness and generalization of deep learning models in fatigue detection."
                },
                {
                  "reference": "Zhang_B_2023",
                  "description": "While not directly addressing data augmentation, the study's methodology for constructing brain functional networks could potentially benefit from data augmentation to enhance the diversity and size of the dataset for training.",
                  "note": "Added for its potential to benefit from data augmentation in the context of constructing brain functional networks, which could improve the diversity and size of the training dataset."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "title": "Real-Time Implementation and Edge Computing",
      "section_id": "6 Real-Time Implementation and Edge Computing",
      "methods": [
        {
          "title": "Challenges of Real-Time Fatigue Detection",
          "section_id": "6.1 Challenges of Real-Time Fatigue Detection",
          "examples": [
            {
              "reference": "Nguyen_H_2023",
              "description": "Presents a behind-the-ear EEG-based system for real-time drowsiness detection, offering a more user-friendly solution.",
              "note": "Added for its emphasis on developing a wearable, user-friendly EEG system suitable for practical, real-world fatigue monitoring."
            },
            {
              "reference": "Nguyen_H_2023_1",
              "description": "Explores improvements in behind-the-ear EEG systems for better usability.",
              "note": "Added for its focus on enhancing the usability of wearable EEG systems, which is crucial for the acceptance and effectiveness of real-world fatigue detection applications."
            },
            {
              "reference": "Kaveh_R_2024",
              "description": "Introduces a wireless in-ear EEG system using dry electrodes, demonstrating a more practical approach for continuous monitoring.",
              "note": "Added for its innovative approach to non-intrusive, continuous EEG monitoring using a wireless in-ear system, which addresses usability in real-world applications."
            },
            {
              "reference": "Yin_J_2017",
              "description": "Develops a mobile detection network using a personal EEG node for collecting signals, emphasizing real-time capabilities.",
              "note": "Added for its contribution to mobile EEG technology, which is crucial for developing real-time fatigue detection systems that can be deployed in practical settings."
            },
            {
              "reference": "Wei_C_2018",
              "description": "Investigates non-hair-bearing (NHB) EEG for practical drowsiness detection, simplifying setup and improving comfort.",
              "note": "Added for its focus on practical and user-friendly EEG acquisition methods, which is a key consideration for real-world usability of fatigue detection systems."
            }
          ]
        },
        {
          "title": "Edge Computing for On-Device Processing",
          "section_id": "6.2 Edge Computing for On-Device Processing",
          "examples": [
            {
              "reference": "Bencsik_B_2023",
              "description": "Focuses on an embedded feature selection algorithm for efficient on-device processing in drowsiness detection.",
              "note": "Added for its contribution to edge computing, enabling efficient on-device processing which is essential for real-time applications."
            }
          ]
        },
        {
          "title": "Model Optimization for Resource-Constrained Devices",
          "section_id": "6.3 Model Optimization for Resource-Constrained Devices",
          "examples": [
            {
              "reference": "Gu_T_2024",
              "description": "Proposes a low-power model combining SOM and SNN for real-time fatigue detection, suitable for deployment in resource-limited devices.",
              "note": "Added for its emphasis on low-power, efficient models which are crucial for real-time implementation and edge computing in fatigue detection."
            }
          ]
        }
      ]
    },
    {
      "title": "Addressing Data Scarcity and Class Imbalance",
      "section_id": "7 Addressing Data Scarcity and Class Imbalance",
      "subsections": [
        {
          "title": "Data Augmentation Techniques",
          "section_id": "7.2 Data Augmentation Techniques",
          "examples": [
            {
              "reference": "Zhang_J_2025",
              "description": "Employs GANs to synthesize additional EEG samples, addressing data scarcity.",
              "note": "Added for its use of GANs to address data scarcity by synthesizing EEG samples. Note: The reference year (2025) suggests this is a future work and might need to be considered for the scope of this review."
            }
          ]
        },
        {
          "title": "Techniques for Handling Class Imbalance",
          "section_id": "7.4 Techniques for Handling Class Imbalance",
          "examples": [
            {
              "reference": "An_P_2021",
              "description": "Addresses class imbalance issues in sleep stage classification using hybrid-channel EEG signals and specialized feature extraction techniques.",
              "note": "Added for its approach to handling class imbalance, a common problem in fatigue detection datasets, using specialized feature extraction from hybrid-channel EEG signals."
            }
          ]
        }
      ]
    },
    {
      "title": "Promising Directions for Future Research",
      "section_id": "8 Promising Directions for Future Research",
      "sections": [
        {
          "title": "Advanced Deep Learning Architectures",
          "section_id": "8.1 Advanced Deep Learning Architectures",
          "description": "Explore the potential of novel architectures like Transformers, Capsule Networks, and Spiking Neural Networks for EEG-based fatigue detection.",
          "examples": [
            {
              "reference": "Chen_C_2023",
              "description": "Introduces a Capsule Network (SACC-CapsNet) for improved learning from limited EEG data in fatigue detection.",
              "note": "Added for its exploration of Capsule Networks, a novel architecture with potential for EEG-based fatigue detection."
            },
            {
              "reference": "Tang_M_2024",
              "description": "Highlights the potential of Transformers for capturing long-range dependencies in EEG signals.",
              "note": "Added for its mention of Transformers, a novel architecture with potential for capturing long-range dependencies in EEG signals, relevant for advanced fatigue detection models."
            },
            {
              "reference": "Gu_T_2024",
              "description": "Proposes a low-power model combining SOM and SNN, indicating an exploration of spiking neural networks for efficiency.",
              "note": "Added for its exploration of spiking neural networks, which is a promising direction for energy-efficient fatigue detection systems."
            }
          ],
          "trend": "Investigation of new deep learning architectures tailored for EEG signal analysis and fatigue detection."
        },
        {
          "title": "Enhanced Feature Extraction and Selection",
          "section_id": "8.2 Enhanced Feature Extraction and Selection",
          "description": "Develop advanced feature extraction and selection methods to capture the most relevant information from EEG signals.",
          "examples": [
            {
              "reference": "An_J_2024",
              "description": "Introduces ACF-GCN, which enhances feature extraction through attention mechanisms and graph-based learning.",
              "note": "Added for its introduction of ACF-GCN, enhancing feature extraction through attention mechanisms and graph-based learning."
            },
            {
              "reference": "Bencsik_B_2023",
              "description": "Proposes an embedded feature selection algorithm for efficient dimensionality reduction.",
              "note": "Added for its proposal of an embedded feature selection algorithm, relevant for efficient dimensionality reduction in EEG analysis."
            },
            {
              "reference": "Budak_U_2019",
              "description": "Combines statistical and deep learning features for enhanced EEG-based drowsiness detection.",
              "note": "Added for its combination of statistical and deep learning features, contributing to enhanced EEG-based drowsiness detection."
            },
            {
              "reference": "Chen_C_2023",
              "description": "Focuses on capturing inter-channel relations and uses a capsule network for improved feature learning under limited data.",
              "note": "Added for its focus on capturing inter-channel relations and using a capsule network, relevant for improved feature learning with limited EEG data."
            },
            {
              "reference": "Chen_J_2018_2",
              "description": "Combines SL and MST for effective feature extraction and classification in driver drowsiness detection.",
              "note": "Added for its combination of SL and MST for effective feature extraction and classification, relevant for driver drowsiness detection."
            },
            {
              "reference": "Chen_J_2018_3",
              "description": "Develops a feature fusion method (FBN-PSD-FF) to enhance the classification performance of fatigue detection systems.",
              "note": "Added for its development of a feature fusion method, relevant for enhancing the classification performance of fatigue detection systems."
            },
            {
              "reference": "Chen_J_2019",
              "description": "Integrates functional connectivity and graph theory for feature extraction in assessing driver fatigue.",
              "note": "Added for its integration of functional connectivity and graph theory, relevant for feature extraction in assessing driver fatigue."
            },
            {
              "reference": "Chen_K_2022",
              "description": "Proposes a multi-domain feature extraction and fusion algorithm for mental fatigue detection.",
              "note": "Added for its proposal of a multi-domain feature extraction and fusion algorithm, relevant for mental fatigue detection."
            },
            {
              "reference": "Chen_K_2024",
              "description": "Utilizes a dual-graph GCN architecture for feature extraction, focusing on spatial inter-channel connectivity.",
              "note": "Added for its utilization of a dual-graph GCN architecture, relevant for feature extraction focusing on spatial inter-channel connectivity."
            },
            {
              "reference": "Chung_G_2018",
              "description": "Focuses on feature extraction from EEG and gyroscope data for early driver drowsiness detection.",
              "note": "Added for its focus on feature extraction from EEG and gyroscope data, relevant for early driver drowsiness detection."
            },
            {
              "reference": "Chung_G_2018_1",
              "description": "Utilizes feature extraction from EEG and gyroscope data, with a focus on real-time monitoring and closed-loop feedback.",
              "note": "Added for its utilization of feature extraction from EEG and gyroscope data, relevant for real-time monitoring and closed-loop feedback."
            },
            {
              "reference": "Cui_J_2021",
              "description": "Employs CNN for feature extraction from EEG signals, tailored to capture essential EEG frequencies related to alertness and drowsiness.",
              "note": "Added for its employment of CNN for feature extraction, tailored to capture essential EEG frequencies related to alertness and drowsiness."
            },
            {
              "reference": "Cui_J_2022",
              "description": "Focuses on feature extraction from cross-subject data using CNNs, with an emphasis on discovering shared EEG features indicative of driver drowsiness.",
              "note": "Added for its focus on feature extraction from cross-subject data using CNNs, relevant for discovering shared EEG features indicative of driver drowsiness."
            },
            {
              "reference": "Cui_J_2023_1",
              "description": "Utilizes a novel interpretation technique for feature analysis in an interpretable CNN architecture.",
              "note": "Added for its utilization of a novel interpretation technique for feature analysis, relevant for an interpretable CNN architecture."
            },
            {
              "reference": "Dogan_S_2023",
              "description": "Utilizes wavelet packet decomposition for feature extraction from EEG signals in the frequency domain.",
              "note": "Added for its utilization of wavelet packet decomposition for feature extraction in the frequency domain, relevant for EEG-based fatigue detection."
            },
            {
              "reference": "Farhangi_F_2022_1",
              "description": "Focuses on feature extraction and the impact of hyperparameter tuning on classification accuracy.",
              "note": "Added for its emphasis on feature extraction and the impact of hyperparameter tuning, relevant for enhancing classification accuracy in fatigue detection."
            },
            {
              "reference": "Farhangi_F_2023",
              "description": "Emphasizes feature extraction combining machine learning algorithms with spatial factors derived from EEG data.",
              "note": "Added for its emphasis on feature extraction combining machine learning algorithms with spatial factors, relevant for EEG-based fatigue detection."
            },
            {
              "reference": "Feng_W_2024",
              "description": "Employs a separable CNN for feature extraction from EEG data, focusing on both spatial and temporal aspects.",
              "note": "Added for its employment of a separable CNN for feature extraction, relevant for analyzing both spatial and temporal aspects of EEG data in fatigue detection."
            },
            {
              "reference": "Gao_D_2023_1",
              "description": "Focuses on feature extraction from EEG and ECG signals using a fusion-separation mechanism in the PFCN model.",
              "note": "Added for its focus on feature extraction from both EEG and ECG signals, relevant for a multimodal approach to fatigue detection."
            },
            {
              "reference": "Gao_D_2024_1",
              "description": "Emphasizes feature extraction using a dual-graph approach, with both time-frequency characteristics via Pearson correlation and magnitude-squared coherence.",
              "note": "Added for its emphasis on feature extraction using a dual-graph approach, relevant for capturing time-frequency characteristics in fatigue detection."
            },
            {
              "reference": "Hao_C_2021",
              "description": "Utilizes feature extraction through recurrence plots, which are then processed by CNNs for classification.",
              "note": "Added for its utilization of feature extraction through recurrence plots, relevant for representing EEG signals in a format suitable for CNN processing."
            },
            {
              "reference": "Hu_F_2024",
              "description": "Integrates a temporal-channel attention module and a channel-connectivity attention module for refining EEG signals and capturing significant features.",
              "note": "Added for its integration of attention modules for refining EEG signals and capturing significant features, relevant for effective fatigue detection."
            },
            {
              "reference": "Jantan_S_2022",
              "description": "Employs DWT for feature extraction from EEG signals, focusing on time-domain analysis for drowsiness detection.",
              "note": "Added for its employment of DWT for feature extraction in the time domain, relevant for EEG-based drowsiness detection."
            },
            {
              "reference": "Latreche_I_2022",
              "description": "Focuses on feature extraction using a CNN-LSTM model, optimizing performance through cross-validation techniques.",
              "note": "Added for its focus on feature extraction using a CNN-LSTM model, relevant for fatigue detection through EEG signals."
            },
            {
              "reference": "Latreche_I_2025",
              "description": "Emphasizes feature extraction using a combination of CNN and various ML classifiers, with preprocessing optimization via random search.",
              "note": "Added for its emphasis on feature extraction using a combination of CNN and ML classifiers, relevant for enhancing the accuracy of fatigue detection."
            },
            {
              "reference": "Lian_Z_2024",
              "description": "Employs separate encoders for EEG and eye-tracking data for feature extraction, followed by a cross-modal predictive alignment module.",
              "note": "Added for its use of separate encoders for multimodal feature extraction, relevant for combining EEG and eye-tracking data in fatigue detection."
            },
            {
              "reference": "Lin_Z_2021",
              "description": "Focuses on feature extraction using specific entropy and fractal dimension features for constructing a dynamic functional brain network.",
              "note": "Added for its focus on specific entropy and fractal dimension features, relevant for constructing a dynamic functional brain network in fatigue analysis."
            },
            {
              "reference": "Liu_H_2023",
              "description": "Utilizes a channel attention mechanism and a multi-semantic dynamical graph convolution for feature extraction from EEG signals.",
              "note": "Added for its utilization of a channel attention mechanism and graph convolution for feature extraction, relevant for enhancing detection accuracy in fatigue detection."
            },
            {
              "reference": "Liu_Y_2016",
              "description": "Employs feature extraction techniques to capture physiological changes indicative of fatigue, using a recurrent self-evolving fuzzy neural network.",
              "note": "Added for its use of feature extraction techniques to capture physiological changes, relevant for predicting driving fatigue using EEG and other physiological signals."
            },
            {
              "reference": "Ma_C_2024",
              "description": "Utilizes multi-layer convolution networks for feature extraction from EEG signals, enhanced by a domain discriminator for alignment.",
              "note": "Added for its utilization of multi-layer convolution networks for feature extraction, relevant for addressing domain shift in cross-subject fatigue recognition."
            },
            {
              "reference": "Ma_Y_2019",
              "description": "Integrates PCA for dimensionality reduction with PCANet for feature extraction from EEG signals.",
              "note": "Added for its integration of PCA and PCANet for feature extraction, relevant for dimensionality reduction and fatigue state classification."
            },
            {
              "reference": "Ma_Y_2020",
              "description": "Focuses on feature extraction through the calculation of power spectral density (PSD) from EEG data.",
              "note": "Added for its focus on feature extraction through PSD calculation, relevant for analyzing driver fatigue using EEG signals."
            },
            {
              "reference": "Mehmood_I_2023",
              "description": "Employs feature extraction from EEG, EDA, and facial feature tracking, using a decision tree model for classification.",
              "note": "Added for its multimodal approach to feature extraction, relevant for classifying mental fatigue in construction workers."
            },
            {
              "reference": "Min_J_2018",
              "description": "Utilizes various entropy measures for feature extraction from EEG signals to analyze driver fatigue.",
              "note": "Added for its utilization of entropy measures for feature extraction, relevant for analyzing driver fatigue through EEG signals."
            },
            {
              "reference": "Min_J_2021",
              "description": "Emphasizes the extraction of features from specific signal sub-bands in hybrid-channel EEG data to distinguish between sleep stages.",
              "note": "Added for its emphasis on extracting features from specific signal sub-bands, relevant for sleep stage classification and potentially fatigue detection."
            },
            {
              "reference": "Nadalizadeh_F_2018",
              "description": "Focuses on feature extraction from both source and sensor spaces, using a variety of features including frequency band powers and ARMA model parameters.",
              "note": "Added for its comprehensive approach to feature extraction, relevant for identifying a wide range of EEG features related to mental fatigue."
            },
            {
              "reference": "Nassehi_F_2024",
              "description": "Extracts time-domain, spectral, and nonlinear features from awake EEG to classify OSA severity, using feature selection via the Relief method.",
              "note": "Added for its extraction of diverse features from EEG signals, relevant for classifying the severity of obstructive sleep apnea and potentially applicable to fatigue detection."
            },
            {
              "reference": "Pan_Y_2024",
              "description": "Employs a CNN for feature extraction from EEG and EOG signals, using a split-band method to preserve modality-specific features.",
              "note": "Added for its use of a CNN for feature extraction from multimodal data, relevant for enhancing fatigue detection through EEG and EOG signals."
            },
            {
              "reference": "Park_J_2021",
              "description": "Employs feature extraction via adaptive auto-regressive coefficients (AAR) and dimensionality reduction using principal component analysis (PCA).",
              "note": "Added for its use of AAR for feature extraction, relevant for capturing dynamic changes in EEG signals during cognitive tasks."
            },
            {
              "reference": "Paulo_J_2021",
              "description": "Focuses on feature extraction using recurrence plots and gramian angular fields for representing EEG signals in image form for CNN processing.",
              "note": "Added for its novel approach to feature extraction using recurrence plots and gramian angular fields, relevant for transforming EEG signals into image representations for deep learning models."
            },
            {
              "reference": "Peng_B_2023",
              "description": "Utilizes a temporal-channel attention module and a channel-connectivity attention module for feature extraction, focusing on critical temporal information and inter-channel relationships.",
              "note": "Added for its innovative use of attention mechanisms for feature extraction, relevant for enhancing fatigue detection by focusing on critical EEG signal components."
            },
            {
              "reference": "Puspasari_M_2023",
              "description": "Focuses on feature extraction from EEG signals using power spectral density (PSD) across various frequency bands.",
              "note": "Added for its use of PSD for feature extraction, relevant for analyzing the distribution of power across different frequency bands in EEG signals."
            },
            {
              "reference": "Qin_X_2023",
              "description": "Employs feature extraction through a global-personalized deep neural network, focusing on shared features across clients and individual data variations.",
              "note": "Added for its approach to feature extraction using a global-personalized deep neural network, relevant for federated learning scenarios in fatigue detection."
            },
            {
              "reference": "Rohit_F_2017",
              "description": "Focuses on spectral analysis for feature extraction from EEG signals, using mental correlation of brain signals for drowsiness detection.",
              "note": "Added for its focus on spectral analysis for feature extraction, relevant for drowsiness detection based on EEG signals."
            },
            {
              "reference": "Sheykhivand_S_2022_1",
              "description": "Utilizes wavelet packet decomposition for feature extraction from EEG signals, employing a classification framework to identify fatigue levels.",
              "note": "Added for its use of wavelet packet decomposition for feature extraction, relevant for a detailed analysis of EEG signals in fatigue detection."
            },
            {
              "reference": "Stancin_I_2021",
              "description": "Focuses on feature extraction from EEG signals using spectral analysis, specifically through power spectral density (PSD) calculations.",
              "note": "Added for its emphasis on spectral analysis for feature extraction, relevant for fatigue detection using EEG signals."
            },
            {
              "reference": "Su_R_2023",
              "description": "Employs feature extraction techniques from physiological signals, including EEG, EOG, ECG, and EMG, using both handcrafted and automated methods.",
              "note": "Added for its comprehensive approach to feature extraction from multiple physiological signals, relevant for multimodal fatigue detection."
            },
            {
              "reference": "Sun_Y_2014",
              "description": "Utilizes feature extraction from functional connectivity matrices derived from EEG data, employing Kendall tau rank correlation coefficients.",
              "note": "Added for its use of functional connectivity matrices for feature extraction, relevant for analyzing brain network topology changes in fatigue detection."
            },
            {
              "reference": "Tang_J_2024",
              "description": "Employs a temporal-channel attention module to investigate critical temporal information and important channels for feature extraction.",
              "note": "Added for its use of a temporal-channel attention module, relevant for focusing on critical temporal information and important channels in EEG signals for fatigue detection."
            },
            {
              "reference": "Tuncer_T_2021",
              "description": "Introduces a feature generator (DCBP) and an advanced feature extractor (MTTP) for EEG signal feature extraction.",
              "note": "Added for its development of novel feature generation and extraction techniques, relevant for enhancing the accuracy of EEG-based fatigue detection systems."
            },
            {
              "reference": "Tuncer_T_2021_1",
              "description": "Employs a four-level implementation of 1D-DWT for multilevel feature extraction from EEG signals.",
              "note": "Added for its application of 1D-DWT for multilevel feature extraction, relevant for a detailed analysis of EEG signals in fatigue detection."
            },
            {
              "reference": "Wang_F_2018",
              "description": "Utilizes wavelet packet transform for decomposing EEG signals into different frequency bands for feature extraction.",
              "note": "Added for its use of wavelet packet transform for feature extraction, relevant for analyzing EEG signals in fatigue detection."
            },
            {
              "reference": "Wang_F_2022_1",
              "description": "Employs wavelet packet transform for decomposing EEG signals and constructs functional brain networks for feature extraction.",
              "note": "Added for its use of wavelet packet transform and functional brain networks for feature extraction, relevant for analyzing EEG signals in fatigue detection."
            },
            {
              "reference": "Wang_F_2023",
              "description": "Utilizes feature extraction from EEG signals, considering time domain, frequency domain, and non-linear features.",
              "note": "Added for its comprehensive approach to feature extraction, considering various domains, relevant for fatigue detection using EEG signals."
            },
            {
              "reference": "Wang_F_2023_1",
              "description": "Employs wavelet packet transform for decomposing EEG signals into frequency bands for feature extraction.",
              "note": "Added for its use of wavelet packet transform for feature extraction, relevant for analyzing EEG signals in fatigue detection."
            },
            {
              "reference": "Wang_F_2024_2",
              "description": "Utilizes wavelet packet decomposition and MF-DFA for feature extraction from EEG signals.",
              "note": "Added for its use of wavelet packet decomposition and MF-DFA for feature extraction, relevant for analyzing EEG signals in fatigue detection."
            },
            {
              "reference": "Wang_F_2024_3",
              "description": "Employs wavelet packet decomposition for feature extraction from EEG signals.",
              "note": "Added for its use of wavelet packet decomposition for feature extraction, relevant for analyzing EEG signals in fatigue detection."
            },
            {
              "reference": "Wang_H_2018",
              "description": "Utilizes wavelet packets transform (WPT) for feature extraction, focusing on specific frequency bands relevant to mental fatigue.",
              "note": "Added for its use of WPT for feature extraction, relevant for analyzing EEG signals in mental fatigue detection."
            },
            {
              "reference": "Wang_H_2019",
              "description": "Employs wavelet packet transform for decomposing EEG signals into frequency bands and uses various entropy measures for feature extraction.",
              "note": "Added for its use of wavelet packet transform and entropy measures for feature extraction, relevant for analyzing EEG signals in fatigue detection."
            },
            {
              "reference": "Wang_H_2021",
              "description": "Utilizes wavelet packet transform for decomposing EEG signals into frequency bands for feature extraction.",
              "note": "Added for its use of wavelet packet transform for feature extraction, relevant for analyzing EEG signals in fatigue detection."
            },
            {
              "reference": "Wang_H_2021_2",
              "description": "Utilizes wavelet packet transform for decomposing EEG signals into frequency bands for feature extraction.",
              "note": "Added for its use of wavelet packet transform for feature extraction, relevant for analyzing EEG signals in fatigue detection."
            },
            {
              "reference": "Wang_J_2022",
              "description": "Utilizes wavelet packet transform for decomposing EEG signals into frequency bands and employs PLI for functional connectivity assessment.",
              "note": "Added for its use of wavelet packet transform and PLI for feature extraction, relevant for analyzing EEG signals in fatigue detection."
            },
            {
              "reference": "Wang_J_2023",
              "description": "Employs convolutional layers in a CNN for feature extraction from EEG signals.",
              "note": "Added for its use of convolutional layers for feature extraction, relevant for analyzing EEG signals in fatigue detection."
            },
            {
              "reference": "Wang_K_2019",
              "description": "Utilizes Morlet wavelet kernels for time-frequency feature extraction from EEG signals.",
              "note": "Added for its use of Morlet wavelet kernels for time-frequency feature extraction, relevant for analyzing EEG signals in fatigue detection."
            },
            {
              "reference": "Wang_K_2024",
              "description": "Employs a graph convolutional network (GCN) for feature extraction, focusing on spatial inter-channel connectivity in EEG data.",
              "note": "Added for its use of a GCN for feature extraction, relevant for analyzing spatial inter-channel connectivity in EEG data for fatigue detection."
            },
            {
              "reference": "Wei_C_2018",
              "description": "Utilizes wavelet packet analysis for feature extraction, focusing on enhancing the detection of drowsiness.",
              "note": "Added for its use of wavelet packet analysis, contributing to the methods for feature extraction from EEG signals in the context of drowsiness detection."
            },
            {
              "reference": "Wu_D_2017",
              "description": "Employs fuzzy sets for feature extraction to handle variations in EEG data across different subjects.",
              "note": "Added for its use of fuzzy sets in feature extraction, addressing the challenge of EEG data variability among subjects for improved fatigue detection accuracy."
            },
            {
              "reference": "Wu_E_2019",
              "description": "Utilizes wavelet packet transform for feature extraction from EEG signals.",
              "note": "Added for its application of wavelet packet transform in feature extraction, enhancing the analysis of EEG signals for fatigue detection."
            },
            {
              "reference": "Wu_E_2020",
              "description": "Employs Hilbert transform for instantaneous spectral feature extraction from EEG signals.",
              "note": "Added for its use of Hilbert transform in extracting instantaneous spectral features, contributing to the detailed analysis of EEG signals for fatigue detection."
            },
            {
              "reference": "wu_E_2021",
              "description": "Utilizes sparse coding with contraction mappings for feature extraction from EEG data, focusing on local variations.",
              "note": "Added for its innovative approach to feature extraction using sparse coding, which is particularly useful for detecting subtle changes in EEG signals indicative of fatigue."
            },
            {
              "reference": "Wu_E_2021_1",
              "description": "Extracts power spectral density features from EEG signals to enhance fatigue detection capability.",
              "note": "Added for its focus on power spectral density features, which are crucial for understanding the frequency distribution of EEG signals in fatigue detection."
            },
            {
              "reference": "Wu_E_2022",
              "description": "Utilizes ensemble wavelet transform and Hilbert transform for instantaneous spectrum feature extraction from EEG signals.",
              "note": "Added for its combined use of ensemble wavelet transform and Hilbert transform, offering a robust method for feature extraction in EEG-based fatigue detection."
            },
            {
              "reference": "Wu_W_2021",
              "description": "Employs dimension reduction techniques and feature fusion for EEG and EOG data to enhance vigilance estimation.",
              "note": "Added for its strategy of dimension reduction and feature fusion, improving the efficiency and accuracy of vigilance estimation using multimodal data."
            },
            {
              "reference": "Wu_X_2023",
              "description": "Utilizes mathematical morphology for feature extraction, focusing on the morphological characteristics of EEG signals.",
              "note": "Added for its application of mathematical morphology, which provides a unique perspective on feature extraction by analyzing the shape and structure of EEG signals for fatigue detection."
            },
            {
              "reference": "Xiao_H_2018",
              "description": "Applies Power Spectrum Density (PSD) analysis to extract features from EEG signals, capturing frequency domain characteristics relevant to mental fatigue.",
              "note": "Added for its use of PSD analysis in feature extraction, a well-established technique for evaluating EEG signals in the context of fatigue."
            },
            {
              "reference": "Yogarajan_G_2023",
              "description": "Utilizes 2D CNNs for feature extraction from EEG and ECG signals, focusing on temporal and spatial patterns.",
              "note": "Added for its application of 2D CNNs to extract features from both EEG and ECG, demonstrating a multimodal approach to fatigue detection."
            },
            {
              "reference": "Yuan_D_2023",
              "description": "Employs a combination of CNN and RNN for automatic feature extraction from EEG signals, focusing on spatial and temporal correlations indicative of fatigue.",
              "note": "Added for its hybrid CNN and RNN approach to feature extraction, which captures both spatial and temporal information from EEG signals for fatigue detection."
            },
            {
              "reference": "Yuan_D_2023_1",
              "description": "Utilizes a Residual Network (ResNet) with a Channel Attention Mechanism for feature extraction from EEG signals, focusing on domain-invariant features.",
              "note": "Added for its use of a ResNet with a channel attention mechanism, which enhances feature extraction by focusing on domain-invariant features across different EEG datasets."
            },
            {
              "reference": "Yuan_L_2024",
              "description": "Employs an ensemble-like structure with multiple branch classifiers for feature extraction, focusing on domain alignment and uncertainty reduction.",
              "note": "Added for its ensemble-based approach to feature extraction, improving robustness and accuracy in cross-dataset fatigue detection through domain alignment."
            },
            {
              "reference": "Yu_C_2010",
              "description": "Combines wavelet packet features from EEG with power spectral indices from HRV for feature extraction, enhancing mental fatigue estimation.",
              "note": "Added for its multimodal approach, combining wavelet packet features and power spectral indices for a comprehensive assessment of mental fatigue."
            },
            {
              "reference": "Yu_H_2017",
              "description": "Utilizes Independent Component Analysis (ICA) to decompose EEG signals into independent components for feature extraction, focusing on non-Gaussian distributions.",
              "note": "Added for its application of ICA in feature extraction, which helps in isolating independent sources of brain activity related to fatigue."
            },
            {
              "reference": "Zayed_A_2024",
              "description": "Utilizes Welch method for RPSD and Discrete Wavelet Transform (DWT) for feature extraction from EEG signals, focusing on time, frequency, and time-frequency domain analysis.",
              "note": "Added for its use of Welch method and DWT, providing a detailed analysis of EEG signals across multiple domains for fatigue detection."
            },
            {
              "reference": "Zeng_C_2022",
              "description": "Utilizes Empirical Mode Decomposition (EMD) and power spectral density for feature extraction from EEG signals, focusing on intrinsic mode functions to emphasize relevant features.",
              "note": "Added for its application of EMD in feature extraction, which is effective in identifying non-stationary and nonlinear features of EEG signals associated with fatigue."
            },
            {
              "reference": "Zeng_H_2018",
              "description": "Employs convolutional layers for feature extraction from EEG signals, focusing on spatial and temporal dependencies to improve classification accuracy.",
              "note": "Added for its use of convolutional layers in deep learning models to automatically extract features, enhancing the accuracy of fatigue detection."
            },
            {
              "reference": "Zeng_H_2019",
              "description": "Utilizes Common Spatial Pattern (CSP) for feature extraction, focusing on spatial filters to enhance EEG signal classification for driver mental state detection.",
              "note": "Added for its application of CSP, which is a well-established technique for spatial feature extraction in EEG signal processing, particularly useful in BCI applications."
            },
            {
              "reference": "Zeng_H_2020",
              "description": "Utilizes power spectral density (PSD) and differential entropy for feature extraction, combining them with deep learning techniques for mental workload classification.",
              "note": "Added for its combination of traditional feature extraction methods with deep learning, enhancing the classification of mental workload states from EEG data."
            },
            {
              "reference": "Zeng_H_2021",
              "description": "Employs power spectral density (PSD) for feature extraction from EEG signals, focusing on frequency domain analysis to detect fatigue.",
              "note": "Added for its use of PSD as a feature extraction method, which is effective in identifying fatigue-related changes in EEG frequency bands."
            },
            {
              "reference": "Zhang_B_2023",
              "description": "Utilizes wavelet packet transform for decomposing EEG signals into frequency bands and employs PLV and PLI for functional connectivity assessment.",
              "note": "Added for its approach to constructing brain functional networks, which provides insights into the connectivity patterns associated with fatigue states."
            },
            {
              "reference": "Zhang_C_2008",
              "description": "Utilizes wavelet packet decomposition for feature extraction, focusing on relative wavelet packet energy and entropy from EEG signals.",
              "note": "Added for its wavelet-based feature extraction method, which is effective in capturing the non-stationary characteristics of EEG signals during fatigue."
            },
            {
              "reference": "Zhang_H_2023_1",
              "description": "Utilizes wavelet packet transform (WPT) for multi-resolution analysis of EEG signals, enabling extraction of nuanced information from various frequency bands.",
              "note": "Added for its application of WPT, which allows for a detailed examination of EEG signals across different scales, enhancing fatigue detection accuracy."
            },
            {
              "reference": "Zhang_J_2025",
              "description": "Utilizes continuous wavelet transform for spectral-temporal representation and employs a temporal-frequential attention mechanism for feature extraction.",
              "note": "Added for its use of continuous wavelet transform and attention mechanisms, offering advanced techniques for analyzing EEG signals in fatigue recognition. Note: The reference year (2025) suggests this is a future work and might need to be considered for the scope of this review."
            },
            {
              "reference": "Zhang_L_2020",
              "description": "Utilizes wavelet entropy and a combination of synchronization likelihood (SL) and minimum spanning tree (MST) for feature extraction.",
              "note": "Added for its novel combination of wavelet entropy, SL, and MST, providing a comprehensive approach to analyzing EEG signal complexity and connectivity for fatigue detection."
            },
            {
              "reference": "Zhang_M_2022",
              "description": "Employs spectral analysis based on FFT for feature extraction, focusing on a single frequency in the alpha sub-band.",
              "note": "Added for its straightforward approach using FFT, which is effective in identifying fatigue-related changes in specific EEG frequency bands."
            },
            {
              "reference": "Zhang_S_2021",
              "description": "Utilizes wavelet threshold denoising for preprocessing EEG data before feature extraction, enhancing signal quality for fatigue detection.",
              "note": "Added for its emphasis on preprocessing techniques that improve the reliability of feature extraction in EEG-based fatigue detection."
            },
            {
              "reference": "Zhang_S_2021_1",
              "description": "Utilizes discrete wavelet transform (DWT) for feature extraction from EEG signals, focusing on approximate entropy and energy within specific sub-bands.",
              "note": "Added for its use of DWT, which is effective in capturing localized time-frequency information from EEG signals, enhancing fatigue detection accuracy."
            },
            {
              "reference": "Zhang_W_2020",
              "description": "Utilizes wavelet packet transform and partial directed coherence for feature extraction from EEG signals, focusing on frequency band analysis and functional connectivity.",
              "note": "Added for its advanced approach to analyzing EEG signals through wavelet packet transform and partial directed coherence, offering insights into fatigue-related brain connectivity."
            },
            {
              "reference": "Zhang_X_2017",
              "description": "Utilizes Fast Fourier Transform (FFT) for power spectrum density estimation in feature extraction from EEG signals.",
              "note": "Added for its application of FFT, a fundamental technique in EEG signal processing, to quantify fatigue-related changes in brain activity."
            },
            {
              "reference": "Zhang_X_2023",
              "description": "Utilizes linear prediction for time domain feature extraction and Riemannian geometric method for spatial domain features from EEG data.",
              "note": "Added for its innovative combination of linear prediction and Riemannian geometry, providing a comprehensive approach to analyzing EEG signals for fatigue detection."
            },
            {
              "reference": "Zhang_Y_2023_4",
              "description": "Utilizes wavelet packet decomposition for EEG signal analysis and feature extraction in different frequency bands.",
              "note": "Added for its use of wavelet packet decomposition, which allows for detailed analysis of EEG signals across various frequency bands relevant to fatigue states."
            },
            {
              "reference": "Zhang_Z_2016",
              "description": "Utilizes wavelet denoising and Fast Fourier Transformation (FFT) for feature extraction, focusing on power spectrum density features from EEG signals.",
              "note": "Added for its combination of wavelet denoising and FFT, enhancing the quality of EEG signals and the accuracy of feature extraction for fatigue detection."
            },
            {
              "reference": "Zhao_C_2011",
              "description": "Utilizes wavelet packet decomposition for feature extraction from EEG signals, focusing on frequency domain analysis to identify fatigue states.",
              "note": "Added for its application of wavelet packet decomposition, which provides a detailed frequency domain analysis of EEG signals, aiding in fatigue state classification."
            },
            {
              "reference": "Zhao_C_2011_1",
              "description": "Utilizes wavelet packet transform for feature extraction, focusing on the energy distribution across different frequency bands of EEG signals.",
              "note": "Added for its focus on wavelet packet transform, enabling the analysis of energy distribution in EEG signals, which is crucial for fatigue detection."
            },
            {
              "reference": "Zhao_Y_2021",
              "description": "Utilizes power spectral density (PSD) for feature extraction from EEG signals, focusing on frequency domain analysis to identify fatigue states.",
              "note": "Added for its use of PSD, a fundamental technique in EEG analysis, to extract frequency-domain features relevant to fatigue detection."
            },
            {
              "reference": "Zhao_Y_2023",
              "description": "Utilizes power spectral density (PSD) for feature extraction from EEG signals, combined with a deep learning framework for cognitive state recognition.",
              "note": "Added for its integration of PSD with deep learning, showcasing an advanced approach to feature extraction and cognitive state recognition from EEG data."
            },
            {
              "reference": "Zheng_C_2008",
              "description": "Utilizes wavelet packet parameters from EEG signals combined with power spectral indices from HRV for feature extraction in mental fatigue estimation.",
              "note": "Added for its combined use of wavelet packet parameters and HRV indices, offering a multimodal approach to feature extraction for mental fatigue estimation."
            },
            {
              "reference": "Zheng_R_2022",
              "description": "Utilizes empirical modal decomposition (EMD) and amplitude locking value (ALV) for feature extraction from EEG signals to assess brain functional connectivity.",
              "note": "Added for its use of EMD and ALV, providing a novel method for feature extraction that assesses brain functional connectivity in the context of fatigue."
            },
            {
              "reference": "Zheng_Y_2022",
              "description": "Utilizes ensemble empirical mode decomposition (EEMD) and power spectral density (PSD) for feature extraction from EEG signals to improve fatigue detection accuracy.",
              "note": "Added for its application of EEMD and PSD, enhancing feature extraction by addressing the mode mixing problem of traditional EMD and focusing on power spectral features."
            },
            {
              "reference": "Zhou_Y_2023",
              "description": "Utilizes graph theoretical analysis for feature extraction from functional brain networks constructed using EEG signals, focusing on network properties like clustering coefficient and path length.",
              "note": "Added for its graph theoretical analysis approach, providing insights into the topological changes of brain networks associated with fatigue."
            },
            {
              "reference": "Zhu_M_2021",
              "description": "Utilizes power spectral density (PSD) analysis and deep learning models like Inception and Modified AlexNet for feature extraction from EEG signals to detect driver drowsiness.",
              "note": "Added for its combination of PSD analysis and deep learning models, offering an advanced approach to feature extraction for driver drowsiness detection."
            },
            {
              "reference": "Zhuang_Z_2024",
              "description": "Utilizes power spectral density (PSD) and differential entropy (DE) for EEG feature extraction, processed through a self-attention mechanism and graph neural network for drowsiness classification.",
              "note": "Added for its use of PSD and DE with advanced processing techniques, providing a sophisticated method for feature extraction and classification in drowsiness detection."
            },
            {
              "reference": "Zou_S_2020",
              "description": "Utilizes wavelet entropy to extract features from EEG signals for constructing functional brain networks, focusing on complexity and uncertainty measures.",
              "note": "Added for its use of wavelet entropy in constructing functional brain networks, offering insights into the complexity and uncertainty of brain states during fatigue."
            },
            {
              "reference": "Zou_S_2020_1",
              "description": "Utilizes empirical mode decomposition (EMD) for feature extraction from EEG signals, focusing on multi-scale entropy to identify optimal scale features for fatigue detection.",
              "note": "Added for its application of EMD and multi-scale entropy, providing a detailed method for feature extraction and fatigue detection from EEG signals."
            }
          ],
          "trend": "Development of feature extraction techniques tailored for multi-modal EEG analysis and fatigue detection."
        },
        {
          "title": "Multimodal Fusion and Contextual Information",
          "section_id": "8.3 Multimodal Fusion and Contextual Information",
          "description": "Advocate for integrating EEG with other physiological signals and contextual data (e.g., driving environment, time of day).",
          "examples": [
            {
              "reference": "Ahn_S_2016",
              "description": "Combines EEG, ECG, and fNIRS for a comprehensive analysis of drivers' mental states.",
              "note": "Added for its multimodal approach, combining EEG, ECG, and fNIRS to provide a comprehensive analysis of drivers' mental states."
            },
            {
              "reference": "Cao_L_2016",
              "description": "Integrates EEG and eye movement signals for real-time drowsiness detection.",
              "note": "Added for its integration of EEG and eye movement signals, demonstrating the value of combining neurological and behavioral data for real-time drowsiness detection."
            },
            {
              "reference": "Cao_L_2024",
              "description": "Introduces a multimodal tensor fusion network (MTFN-SAM) for fatigue recognition, integrating EEG, HR, GSR, and ACC.",
              "note": "Added for its introduction of a multimodal tensor fusion network, showcasing an advanced method for integrating diverse physiological signals to enhance fatigue recognition."
            },
            {
              "reference": "Etemad_G_2019",
              "description": "Utilizes multimodal EEG and EOG data for driver vigilance estimation.",
              "note": "Added for its use of multimodal EEG and EOG data, illustrating the benefits of combining brain and eye activity measurements for driver vigilance estimation."
            },
            {
              "reference": "Etemad_G_2021",
              "description": "Proposes a multimodal architecture for estimating driver vigilance based on EEG and EOG signals.",
              "note": "Added for its multimodal architecture proposal, further emphasizing the integration of EEG and EOG signals for a more accurate estimation of driver vigilance."
            },
            {
              "reference": "Farha_N_2022",
              "description": "Combines EEG and eye-tracking data to assess vigilance levels, achieving high accuracy.",
              "note": "Added for its combination of EEG and eye-tracking data, demonstrating the effectiveness of multimodal data fusion in assessing vigilance levels with high accuracy."
            },
            {
              "reference": "Fu_R_2016",
              "description": "Integrates EEG, EMG, and respiration signals with contextual information for continuous fatigue estimation.",
              "note": "Added for its integration of multiple physiological signals with contextual information, highlighting the value of a holistic approach to continuous fatigue estimation."
            },
            {
              "reference": "Giorgi_A_2023",
              "description": "Assesses mental fatigue using multiple biosignals (EEG, EOG, EDA, PPG), enhancing safety in automated driving.",
              "note": "Added for its assessment of mental fatigue using a wide range of biosignals, showcasing the potential of multimodal data in enhancing safety in automated driving."
            },
            {
              "reference": "Han_S_2020",
              "description": "Utilizes multimodal biosignals, including EEG, ECG, respiration, and EDA, for classifying pilots' mental states.",
              "note": "Added for its use of multimodal biosignals in classifying pilots' mental states, demonstrating the application of multimodal data in safety-critical professions beyond driving."
            },
            {
              "reference": "Lian_Z_2024",
              "description": "Proposes a multimodal architecture integrating EEG and eye-tracking data for enhanced fatigue detection accuracy.",
              "note": "Added for its proposal of a multimodal architecture that integrates EEG and eye-tracking data, further supporting the trend towards combining multiple data sources for improved fatigue detection."
            },
            {
              "reference": "Mehmood_I_2023",
              "description": "Combines EEG, EDA, and video signals to classify mental fatigue in construction workers.",
              "note": "Added for its combination of EEG, EDA, and video signals, illustrating the application of multimodal data fusion in occupational safety and fatigue detection."
            },
            {
              "reference": "Tang_M_2024",
              "description": "Integrates EEG and EOG signals using advanced multimodal fusion techniques for driver vigilance estimation.",
              "note": "Added for its integration of EEG and EOG signals using advanced fusion techniques, contributing to the development of more accurate driver vigilance estimation methods."
            },
            {
              "reference": "Yogarajan_G_2023",
              "description": "Integrates EEG and ECG signals for drowsiness detection, demonstrating the effectiveness of a hybrid approach.",
              "note": "Added for its integration of EEG and ECG signals, showcasing the effectiveness of a hybrid approach in drowsiness detection and the growing interest in multimodal data fusion."
            },
            {
              "reference": "Guo_M_2016",
              "description": "Combines physiological signals (EEG and ECG) and reaction time measurements, optimizing class classification accuracy through SVM enhanced by grey correlation analysis and genetic algorithms.",
              "note": "Added for its combination of physiological signals and reaction time measurements, demonstrating a comprehensive approach to fatigue detection optimized through advanced analytical techniques."
            },
            {
              "reference": "Hasan_M_2022",
              "description": "Utilizes EEG, EOG, and ECG signals combined with subjective sleepiness measurements to improve the accuracy of drowsiness detection.",
              "note": "Added for its use of multiple physiological signals alongside subjective sleepiness measurements, highlighting the importance of a multimodal approach for accurate drowsiness detection."
            },
            {
              "reference": "Hasan_M_2024",
              "description": "Employs a multimodal system utilizing EEG, EOG, and ECG signals, emphasizing model robustness and explainability through SHAP analysis and partial dependency analysis.",
              "note": "Added for its emphasis on model robustness and explainability in a multimodal system, contributing to the development of more transparent and reliable fatigue detection models."
            },
            {
              "reference": "Ko_L_2020",
              "description": "Combines electrocortical activity features and eyeblink recognition for accurate prediction of inattention using a single EEG sensor.",
              "note": "Added for its combination of electrocortical activity features and eyeblink recognition, demonstrating the potential of using a single EEG sensor for accurate inattention prediction."
            },
            {
              "reference": "Laurent_F_2013",
              "description": "Combines EEG, EOG, and ECG for on-line mental fatigue monitoring, showing that EEG is the most effective modality, with ECG contributing positively when combined with EEG.",
              "note": "Added for its investigation into the combination of EEG, EOG, and ECG for mental fatigue monitoring, highlighting the effectiveness of EEG and the positive contribution of ECG in a multimodal approach."
            },
            {
              "reference": "Liu_Y_2016",
              "description": "Combines EEG signals with other physiological signals (EOG, ECG, EMG) to predict driving fatigue, using a recurrent self-evolving fuzzy neural network (RSEFNN).",
              "note": "Added for its combination of EEG signals with other physiological signals, demonstrating a multimodal approach to predicting driving fatigue using advanced neural network techniques."
            },
            {
              "reference": "Mehmood_I_2023",
              "description": "Utilizes a combination of electroencephalography (EEG), electrodermal activity (EDA), and video signals for a multimodal approach to fatigue detection.",
              "note": "Added for its use of multiple physiological signals and video data, showcasing a comprehensive multimodal approach to fatigue detection in construction workers."
            },
            {
              "reference": "Wang_F_2018",
              "description": "Combines EEG signals with other physiological signals like ECG and EMG for fatigue detection.",
              "note": "Added for its combination of EEG with other physiological signals, demonstrating the value of integrating multiple data sources for fatigue detection."
            }
          ],
          "trend": "Development of advanced fusion algorithms combining multi-modal and contextual data for robust fatigue detection."
        },
        {
          "title": "Personalized and Adaptive Models",
          "description": "Emphasize the need for personalized fatigue detection models that adapt to individual differences in EEG patterns.",
          "examples": [
            {
              "reference": "Zhao_Y_2021",
              "description": "Introduces LA-MSDA, which aligns EEG features across subjects using adversarial learning and label-based alignment, demonstrating a subject-independent approach.",
              "note": "Added for its introduction of LA-MSDA, showcasing a method for aligning EEG features across subjects through adversarial learning and label-based alignment."
            },
            {
              "reference": "Liang_S_2024",
              "description": "Presents AMK-TMM, which leverages knowledge from multiple source subjects through a leave-one-out cross-validation strategy, facilitating personalized model adaptation.",
              "note": "Added for its presentation of AMK-TMM, demonstrating a method for leveraging knowledge from multiple source subjects to facilitate personalized model adaptation."
            }
          ],
          "trend": "Exploration of adaptive and transfer learning techniques for individualized EEG-based fatigue detection."
        },
        {
          "title": "Real-World Validation and Deployment",
          "description": "Advocate for more real-world driving studies to validate models under realistic conditions.",
          "examples": [
            {
              "reference": "Chen_J_2019",
              "description": "Presents an EEG-based system to detect driver fatigue during real driving, identifying differences in functional brain connectivity.",
              "note": "Added for its focus on detecting driver fatigue during real driving, highlighting the importance of validating EEG-based systems in realistic conditions."
            },
            {
              "reference": "Chen_J_2021",
              "description": "Proposes an end-to-end deep learning approach for real-time drowsiness detection during driving using multi-channel EEG signals.",
              "note": "Added for its proposal of an end-to-end deep learning approach for real-time drowsiness detection, emphasizing the need for systems that can operate effectively during actual driving."
            },
            {
              "reference": "Chung_G_2018",
              "description": "Evaluates a wireless, wearable brain-machine interface system for early detection and management of driver drowsiness in simulated driving.",
              "note": "Added for its evaluation of a wireless, wearable brain-machine interface system, moving towards more practical and user-friendly solutions for driver drowsiness detection."
            },
            {
              "reference": "Chung_G_2018_1",
              "description": "Studies an improved wearable brain-machine interface for drowsiness detection.",
              "note": "Added for its study on an improved wearable brain-machine interface, focusing on practical and user-friendly aspects for drowsiness detection."
            },
            {
              "reference": "Hultman_M_2021",
              "description": "Develops a driver sleepiness detection model trained on real-world driving data, highlighting the need for validation in naturalistic settings.",
              "note": "Added for its development of a driver sleepiness detection model trained on real-world driving data, emphasizing the importance of validation in naturalistic settings."
            },
            {
              "reference": "Feng_W_2024",
              "description": "Develops a real-time GUI for monitoring driver alertness, demonstrating the practical applicability of EEG-based models.",
              "note": "Added for its development of a real-time GUI for monitoring driver alertness, showcasing the practical applicability of EEG-based models in real-world scenarios."
            },
            {
              "reference": "Kartsch_V_2018",
              "description": "Develops a sensor fusion system combining EEG and IMU data for real-time drowsiness monitoring in a wearable format with extended battery life.",
              "note": "Added for its development of a sensor fusion system for real-time drowsiness monitoring, emphasizing the practicality of wearable technology in real-world applications."
            }
          ],
          "trend": "Focus on lightweight, user-friendly, non-intrusive EEG acquisition systems for practical applications."
        },
        {
          "title": "Enhanced Explainability and Transparency",
          "description": "Focus on XAI techniques to improve interpretability of deep learning models for EEG-based fatigue detection.",
          "examples": [
            {
              "reference": "Cui_J_2021",
              "description": "Introduces an interpretable model for drowsiness recognition, allowing visualization of decision-making patterns.",
              "note": "Added for its introduction of an interpretable model that allows visualization of decision-making patterns, enhancing the explainability of EEG-based drowsiness detection."
            },
            {
              "reference": "Cui_J_2022",
              "description": "Develops a compact, interpretable CNN for cross-subject driver drowsiness detection, revealing neurophysiological patterns associated with drowsiness.",
              "note": "Added for its development of a compact, interpretable CNN that reveals neurophysiological patterns associated with drowsiness, contributing to model transparency."
            },
            {
              "reference": "Cui_J_2023_1",
              "description": "Presents an interpretable CNN for calibration-free EEG-based driver drowsiness detection, providing insights into the classification process.",
              "note": "Added for its presentation of an interpretable CNN that provides insights into the classification process, enhancing the understanding of EEG-based drowsiness detection."
            },
            {
              "reference": "Zorzos_I_2023",
              "description": "Employs SHAP values to explain feature contributions in a shallow CNN for mental fatigue detection.",
              "note": "Added for its use of SHAP values to explain feature contributions, improving the transparency and interpretability of the mental fatigue detection model."
            }
          ],
          "trend": "Development of explainable models providing actionable feedback and interpretable predictions."
        },
        {
          "title": "Edge Computing",
          "description": "Explore the use of edge computing to perform data processing and analysis on the device itself, reducing latency and dependence on cloud connectivity.",
          "examples": [
            {
              "reference": "Bencsik_B_2023",
              "description": "Proposes an embedded feature selection algorithm for drowsiness detection, indicating a move towards edge computing for efficient processing.",
              "note": "Added for its proposal of an embedded feature selection algorithm, suggesting a shift towards edge computing for efficient on-device processing in drowsiness detection."
            },
            {
              "reference": "Nguyen_H_2023",
              "description": "Utilizes on-device machine learning for real-time drowsiness detection, showcasing the benefits of edge computing in wearable systems.",
              "note": "Added for its utilization of on-device machine learning, demonstrating the practical application of edge computing in real-time drowsiness detection."
            },
            {
              "reference": "Nguyen_H_2023_1",
              "description": "Employs on-chip processing for real-time drowsiness detection using tiny ML techniques, highlighting the advantages of edge computing.",
              "note": "Added for its employment of on-chip processing, showcasing the potential of tiny ML techniques and edge computing in enhancing real-time drowsiness detection."
            }
          ],
          "trend": "Shift towards on-device processing to reduce reliance on cloud connectivity, minimize latency, and enhance privacy."
        },
        {
          "title": "Real-Time Implementation and Edge Computing",
          "section_id": "6",
          "subsections": [
            {
              "title": "Challenges of Real-Time Fatigue Detection",
              "section_id": "6.1",
              "description": "Discuss the need for low latency and fast processing in real-time applications. Analyze the computational demands of complex machine learning models.",
              "examples": [
                {
                  "reference": "Feng_W_2024",
                  "description": "Develops a real-time GUI for monitoring driver alertness, demonstrating the practical applicability of the model in real-time.",
                  "note": "Added for its development of a real-time GUI, showcasing the practical implementation of fatigue monitoring in real-time scenarios."
                },
                {
                  "reference": "Gu_T_2024",
                  "description": "Aims to develop a low-power model suitable for deployment in devices with limited power resources for real-time monitoring.",
                  "note": "Added for its focus on developing a low-power model for real-time monitoring, addressing the challenge of limited power resources in real-time applications."
                },
                {
                  "reference": "Houshmand_S_2021",
                  "description": "Focuses on real-time detection capabilities using single-feature computation directly from EEG signals.",
                  "note": "Added for its emphasis on real-time detection using single-feature computation, which is crucial for timely interventions in safety-critical applications."
                },
                {
                  "reference": "Hussein_R_2024",
                  "description": "Aims to develop a system capable of real-time fatigue detection to provide timely warnings.",
                  "note": "Added for its focus on developing a system for real-time fatigue detection, highlighting the importance of timely warnings in preventing accidents."
                },
                {
                  "reference": "Kartsch_V_2018",
                  "description": "Focuses on real-time monitoring of drowsiness in a wearable format with extended battery life.",
                  "note": "Added for its focus on real-time monitoring using wearable technology, which is essential for practical applications in fatigue detection."
                },
                {
                  "reference": "Ko_L_2020",
                  "description": "Aims for real-time drowsiness detection using a single EEG sensor, though the study itself is in a controlled setting.",
                  "note": "Added for its aim of real-time drowsiness detection using a single EEG sensor, although the real-world applicability needs further investigation."
                },
                {
                  "reference": "Lian_Z_2024",
                  "description": "Aims for real-time fatigue detection, though the immediate applicability in real-time is noted as a limitation.",
                  "note": "Added for its aim towards real-time fatigue detection, acknowledging the challenges in achieving immediate real-time applicability."
                },
                {
                  "reference": "Liu_Y_2016",
                  "description": "Focuses on real-time detection capabilities, though the study itself is based on simulated driving tasks.",
                  "note": "Added for its focus on real-time detection capabilities, although the study's reliance on simulated driving tasks raises questions about real-world applicability."
                },
                {
                  "reference": "Mehmood_I_2023",
                  "description": "Aims for real-time fatigue monitoring, though the current implementation requires further development for real-time application.",
                  "note": "Added for its aim towards real-time fatigue monitoring, highlighting the need for further development to achieve practical real-time application."
                },
                {
                  "reference": "Mohammedi_M_2023",
                  "description": "Proposes an IoT Cloud solution for real-time alerts, though the focus of the paper is on reviewing existing techniques.",
                  "note": "Added for its proposal of an IoT Cloud solution for real-time alerts, showcasing an innovative approach to real-time fatigue monitoring."
                },
                {
                  "reference": "Zhang_X_2017",
                  "description": "Aims for real-time monitoring using a wireless wearable EEG.",
                  "note": "Added for its aim of real-time monitoring using a wireless wearable EEG, demonstrating the feasibility of real-time fatigue detection in practical settings."
                },
                {
                  "reference": "Zhang_X_2023",
                  "description": "Suggests future work should focus on real-time application of the fatigue detection method.",
                  "note": "Added for its suggestion to focus on real-time application, emphasizing the importance of translating research findings into practical, real-time fatigue detection systems."
                },
                {
                  "reference": "Zorzos_I_2023",
                  "description": "Focuses on achieving low prediction times suitable for real-time applications.",
                  "note": "Added for its focus on low prediction times, which is crucial for the effectiveness of real-time fatigue detection systems."
                },
                {
                  "reference": "Zou_S_2020_1",
                  "description": "Aims for real-time detection, though the study itself is based on simulated driving.",
                  "note": "Added for its aim towards real-time detection, despite the study being based on simulated driving, highlighting the need for real-world validation."
                }
              ],
              "trend": "Focus on real-time processing and low latency for immediate feedback in safety-critical applications."
            },
            {
              "title": "Edge Computing for On-Device Processing",
              "section_id": "6.2",
              "description": "Introduce the concept of edge computing and its advantages for EEG-based systems.",
              "examples": [
                {
                  "reference": "Bencsik_B_2023",
                  "description": "Proposes an embedded feature selection algorithm, suggesting a move towards edge computing for efficient processing.",
                  "note": "Added for its proposal of an embedded feature selection algorithm, indicating a move towards edge computing for efficient processing in EEG-based systems."
                },
                {
                  "reference": "Nguyen_H_2023",
                  "description": "Utilizes on-device machine learning for real-time drowsiness detection.",
                  "note": "Added for its use of on-device machine learning, demonstrating the application of edge computing in real-time drowsiness detection."
                },
                {
                  "reference": "Nguyen_H_2023_1",
                  "description": "Employs on-chip processing for real-time drowsiness detection using tiny ML techniques.",
                  "note": "Added for its employment of on-chip processing, highlighting the use of tiny ML techniques for real-time drowsiness detection on edge devices."
                }
              ],
              "trend": "Shift towards on-device processing to reduce reliance on cloud connectivity, minimize latency, and enhance privacy."
            },
            {
              "title": "Model Optimization for Resource-Constrained Devices",
              "section_id": "6.3",
              "description": "Discuss techniques for model compression, quantization, and pruning to reduce model size and computational cost.",
              "examples": [
                {
                  "reference": "Feng_W_2024",
                  "description": "Optimizes channel selection and neural network parameters, including the use of a separable CNN, to minimize computational resource requirements.",
                  "note": "Added for its optimization of channel selection and neural network parameters using a separable CNN, demonstrating a focus on minimizing computational resource requirements for real-time applications."
                },
                {
                  "reference": "Gao_D_2024_1",
                  "description": "Suggests improving computational efficiency through techniques like channel selection and graph sparsification as part of future work.",
                  "note": "Added for its suggestion of improving computational efficiency through channel selection and graph sparsification, indicating a direction towards optimizing models for resource-constrained devices."
                },
                {
                  "reference": "Hu_F_2024",
                  "description": "Includes selective kernel attention to reduce computational demands and a capsule network designed for improved learning with limited data, suggesting a focus on efficiency.",
                  "note": "Added for its inclusion of selective kernel attention and a capsule network, which are aimed at reducing computational demands and improving learning efficiency, respectively."
                },
                {
                  "reference": "Latreche_I_2025",
                  "description": "Aims to develop a system with reduced computational complexity suitable for real-time applications by optimizing preprocessing and neural network parameters.",
                  "note": "Added for its aim to reduce computational complexity through optimization of preprocessing and neural network parameters, making it suitable for real-time, resource-constrained applications."
                },
                {
                  "reference": "Liu_H_2023",
                  "description": "Optimizes computational costs by utilizing a multi-semantic approach to graph convolution and incorporating channel and spatial attention mechanisms.",
                  "note": "Added for its optimization of computational costs through a multi-semantic approach to graph convolution, demonstrating a method for reducing resource demands in complex models."
                },
                {
                  "reference": "Zorzos_I_2023",
                  "description": "Employs a shallow CNN to minimize computational complexity, achieving fast prediction times suitable for real-time detection.",
                  "note": "Added for its use of a shallow CNN to minimize computational complexity, showcasing an approach to achieving fast prediction times suitable for real-time detection."
                }
              ],
              "trend": "Development of lightweight and efficient models suitable for deployment on wearable devices and in-vehicle systems."
            }
          ]
        }
      ]
    },
    {
      "title": "Explainability and Interpretability",
      "section_id": "4 Explainability and Interpretability",
      "subsections": [
        {
          "title": "Techniques for Enhancing Model Interpretability",
          "section_id": "4.2 Techniques for Enhancing Model Interpretability",
          "subsections": [
            {
              "title": "Attention Mechanisms",
              "section_id": "4.2.1 Attention Mechanisms",
              "description": "Explain how attention mechanisms can highlight important features or time points in EEG signals.",
              "examples": [
                {
                  "reference": "An_J_2024",
                  "description": "Employs attention mechanisms across frequency bands to capture crucial interactions between EEG channels, enhancing the model's ability to infer fatigue levels.",
                  "note": "Added for showcasing the use of attention mechanisms across frequency bands to understand EEG channel interactions in fatigue level inference."
                },
                {
                  "reference": "Cao_L_2024",
                  "description": "Applies a self-attention mechanism to discern relevant features across modalities for fatigue recognition.",
                  "note": "Added for illustrating the use of a self-attention mechanism for identifying relevant features in multimodal fatigue recognition."
                },
                {
                  "reference": "Ding_S_2019",
                  "description": "Integrates an attention mechanism to focus on essential parts of the EEG signal, ensuring high accuracy while maintaining a low computational load suitable for mobile devices.",
                  "note": "Added for demonstrating the integration of an attention mechanism to enhance accuracy and computational efficiency in mobile EEG-based drowsiness detection."
                },
                {
                  "reference": "Etemad_G_2019",
                  "description": "Introduces a capsule attention mechanism combined with an LSTM network to enhance focus on important features within the data, leading to improved accuracy in driver vigilance prediction.",
                  "note": "Added for introducing a capsule attention mechanism to improve focus on significant data features, enhancing driver vigilance prediction accuracy."
                },
                {
                  "reference": "Etemad_G_2021",
                  "description": "Employs a capsule attention mechanism in conjunction with a deep LSTM network to focus on significant features within EEG and EOG representations.",
                  "note": "Added for utilizing a capsule attention mechanism with a deep LSTM network to emphasize crucial features in EEG and EOG signals for vigilance estimation."
                },
                {
                  "reference": "Feng_X_2025",
                  "description": "Incorporates coordinate attention to enhance feature representation and interpretation, allowing the model to better localize features critical for classification.",
                  "note": "Added for its use of coordinate attention to enhance feature representation, which aids in localizing critical features for classification. Note: The reference year (2025) suggests this is a future work and might need to be considered for the scope of this review."
                },
                {
                  "reference": "Gao_D_2024_1",
                  "description": "Uses an attention mechanism to enhance feature representation and model interpretability, allowing for a selective approach to EEG signal collection.",
                  "note": "Added for employing an attention mechanism to improve feature representation and model interpretability, facilitating a selective approach to EEG data collection."
                },
                {
                  "reference": "Hu_F_2024",
                  "description": "Integrates temporal-channel attention and channel-connectivity attention to refine EEG signals and capture significant features for effective fatigue detection.",
                  "note": "Added for integrating temporal-channel and channel-connectivity attention to enhance EEG signal processing and capture significant features relevant to fatigue detection."
                },
                {
                  "reference": "Liu_H_2023",
                  "description": "Utilizes channel and spatial attention mechanisms to reinforce feature extraction from EEG signals, enhancing detection accuracy.",
                  "note": "Added for the use of channel and spatial attention mechanisms to enhance feature extraction from EEG signals, improving detection accuracy."
                },
                {
                  "reference": "Tang_M_2024",
                  "description": "Incorporates a topology self-aware attention mechanism to improve the model's ability to focus on the most relevant features for vigilance assessment.",
                  "note": "Added for its incorporation of a topology self-aware attention mechanism, enhancing the model's focus on relevant features for vigilance assessment."
                }
              ],
              "trend": "Providing insights into the model's decision-making process by highlighting influential features."
            },
            {
              "title": "Visualization Techniques",
              "section_id": "4.2.2 Visualization Techniques",
              "description": "Discuss methods for visualizing learned features and model activations (e.g., t-SNE, heatmaps).",
              "examples": [
                {
                  "reference": "Cui_J_2023_1",
                  "description": "Visualizes how input signals influence model predictions, offering insights into EEG feature importance.",
                  "note": "Added for illustrating how visualizations can help understand the influence of input signals on model predictions in EEG-based driver drowsiness recognition."
                },
                {
                  "reference": "Gao_D_2024_1",
                  "description": "Includes visualizations of brain topography to show fatigue's impact on EEG connectivity.",
                  "note": "Added for demonstrating the use of brain topography visualizations to understand the impact of fatigue on EEG connectivity."
                },
                {
                  "reference": "Gao_Z_2018_1",
                  "description": "Uses visualizations to show brain network topology changes associated with driver drowsiness.",
                  "note": "Added for using visualizations to illustrate changes in brain network topology associated with driver drowsiness."
                }
              ],
              "trend": "Making the model's internal representations and decision boundaries more understandable."
            },
            {
              "title": "Rule Extraction",
              "section_id": "4.2.3 Rule Extraction",
              "description": "Explore techniques for extracting human-interpretable rules from complex models.",
              "examples": [
                {
                  "reference": "Mesbah_A_2018",
                  "description": "Uses a fuzzy rule-based system to create interpretable decision rules for alertness classification.",
                  "note": "Added for its use of a fuzzy rule-based system, which enhances interpretability by creating clear decision rules for alertness classification."
                }
              ],
              "trend": "Translating model decisions into understandable rules that can be validated by domain experts."
            },
            {
              "title": "Model-Agnostic Methods",
              "section_id": "4.2.4 Model-Agnostic Methods",
              "description": "Discuss methods like SHAP (SHapley Additive exPlanations) and LIME (Local Interpretable Model-agnostic Explanations) that can be applied to any machine learning model.",
              "examples": [
                {
                  "reference": "Feng_W_2024",
                  "description": "Suggests future work could involve developing deeper model explanations, possibly hinting at the use of model-agnostic methods like SHAP or LIME for interpretability.",
                  "note": "Added for suggesting the potential use of model-agnostic methods like SHAP or LIME to enhance model interpretability in future work."
                }
              ],
              "trend": "Providing post-hoc explanations for model predictions without being tied to a specific model architecture."
            }
          ]
        }
      ]
    },
    {
      "title": "Integration of Multimodal Data",
      "section_id": "5 Integration of Multimodal Data",
      "methods": [
        {
          "title": "Rationale for Multimodal Fusion",
          "section_id": "5.1 Rationale for Multimodal Fusion",
          "description": "Discuss the limitations of relying solely on EEG for fatigue detection and the potential benefits of incorporating other physiological signals and behavioral measures. Highlight the potential benefits of incorporating other physiological signals (e.g., ECG, EOG, EMG) and behavioral measures (e.g., eye tracking, facial expressions, vehicle dynamics)",
          "examples": [
            {
              "reference": "Giorgi_A_2023",
              "description": "Assesses mental fatigue using multiple biosignals (EEG, EOG, EDA, PPG), enhancing safety in automated driving.",
              "note": "Added for illustrating the assessment of mental fatigue using a wide array of biosignals, demonstrating the value of multimodal data in enhancing safety."
            },
            {
              "reference": "Han_S_2020",
              "description": "Utilizes multimodal biosignals, including EEG, ECG, respiration, and EDA, for classifying pilots' mental states.",
              "note": "Added for its use of multimodal biosignals in classifying pilots' mental states, showcasing the application of multimodal data in safety-critical professions beyond driving."
            },
            {
              "reference": "Mehmood_I_2023",
              "description": "Combines EEG, EDA, and video signals to classify mental fatigue in construction workers.",
              "note": "Added for its combination of EEG, EDA, and video signals, illustrating the application of multimodal data fusion in occupational safety and fatigue detection."
            },
            {
              "reference": "Yogarajan_G_2023",
              "description": "Integrates EEG and ECG signals for drowsiness detection, demonstrating the effectiveness of a hybrid approach.",
              "note": "Added for its integration of EEG and ECG signals, showcasing the effectiveness of combining different physiological data types for drowsiness detection."
            },
            {
              "reference": "Hasan_M_2022",
              "description": "Utilizes EEG, EOG, and ECG signals combined with subjective sleepiness measurements to improve the accuracy of drowsiness detection.",
              "note": "Added for its use of multiple physiological signals alongside subjective sleepiness measurements, highlighting the importance of a multimodal approach for accurate drowsiness detection."
            },
            {
              "reference": "Hasan_M_2024",
              "description": "Employs a multimodal system utilizing EEG, EOG, and ECG signals, emphasizing model robustness and explainability through SHAP analysis and partial dependency analysis.",
              "note": "Added for its emphasis on model robustness and explainability in a multimodal system, contributing to the development of more transparent and reliable fatigue detection models."
            },
            {
              "reference": "Laurent_F_2013",
              "description": "Combines EEG, EOG, and ECG for on-line mental fatigue monitoring, showing that EEG is the most effective modality, with ECG contributing positively when combined with EEG.",
              "note": "Added for its investigation into the combination of EEG, EOG, and ECG for mental fatigue monitoring, highlighting the effectiveness of EEG and the positive contribution of ECG in a multimodal approach."
            },
            {
              "reference": "Mehmood_I_2023",
              "description": "Utilizes a combination of electroencephalography (EEG), electrodermal activity (EDA), and video signals for a multimodal approach to fatigue detection.",
              "note": "Added for its use of multiple physiological signals and video data, showcasing a comprehensive multimodal approach to fatigue detection in construction workers."
            }
          ],
          "trend": "Growing interest in multimodal data fusion to provide a more comprehensive and robust assessment of driver fatigue."
        },
        {
          "title": "Fusion Strategies",
          "section_id": "5.2 Fusion Strategies",
          "subsections": [
            {
              "title": "Early Fusion (Feature-Level Fusion)",
              "section_id": "5.2.1 Early Fusion (Feature-Level Fusion)",
              "description": "Discuss different approaches for combining multimodal data, such as early fusion (feature-level), late fusion (decision-level), and hybrid fusion.",
              "examples": [
                {
                  "reference": "Gao_D_2023_1",
                  "description": "Utilizes a fusion-separation mechanism to combine EEG and ECG modalities, allowing independent utilization of features from both for enhanced accuracy (hybrid fusion).",
                  "note": "Added for its use of a fusion-separation mechanism to effectively combine EEG and ECG modalities, demonstrating a hybrid fusion approach."
                },
                {
                  "reference": "Hu_F_2024",
                  "description": "Employs a feature fusion module (FFM) that integrates spatial and temporal features using channel attention mechanisms (hybrid fusion).",
                  "note": "Added for its employment of a feature fusion module that integrates spatial and temporal features, illustrating a hybrid fusion approach."
                }
              ],
              "trend": "Exploration of various fusion strategies to maximize the benefits of multimodal data integration."
            },
            {
              "title": "Late Fusion (Decision-Level Fusion)",
              "section_id": "5.2.2 Late Fusion (Decision-Level Fusion)",
              "description": "Analyze approaches that combine the outputs of separate classifiers trained on each modality.",
              "examples": [],
              "trend": "Leveraging the strengths of individual classifiers and improving overall decision accuracy."
            },
            {
              "title": "Hybrid Fusion",
              "section_id": "5.2.3 Hybrid Fusion",
              "description": "Explore methods that combine both feature-level and decision-level fusion.",
              "examples": [
                {
                  "reference": "Gao_D_2023_1",
                  "description": "Utilizes a fusion-separation mechanism to combine EEG and ECG modalities, allowing independent utilization of features from both for enhanced accuracy.",
                  "note": "Added for its use of a fusion-separation mechanism to effectively combine EEG and ECG modalities, demonstrating a hybrid fusion approach."
                },
                {
                  "reference": "Hu_F_2024",
                  "description": "Employs a feature fusion module (FFM) that integrates spatial and temporal features using channel attention mechanisms.",
                  "note": "Added for its employment of a feature fusion module that integrates spatial and temporal features, illustrating a hybrid fusion approach."
                }
              ],
              "trend": "Maximizing the benefits of both early and late fusion strategies."
            }
          ]
        }
      ]
    },
    {
      "title": "Promising Directions for Future Research",
      "section_id": "8 Promising Directions for Future Research",
      "sections": [
        {
          "title": "Enhanced Explainability and Transparency",
          "description": "Focus on XAI techniques to improve interpretability of deep learning models for EEG-based fatigue detection.",
          "examples": [
            {
              "reference": "Feng_W_2024",
              "description": "Suggests future work could involve developing deeper model explanations, possibly hinting at the use of model-agnostic methods like SHAP or LIME for interpretability.",
              "note": "Added for its suggestion of using model-agnostic methods like SHAP or LIME for interpretability, which is a promising direction for enhancing explainability in fatigue detection models."
            }
          ],
          "trend": "Development of explainable models providing actionable feedback and interpretable predictions."
        },
        {
          "title": "Real-Time Implementation and Edge Computing",
          "section_id": "6",
          "subsections": [
            {
              "title": "Challenges of Real-Time Fatigue Detection",
              "section_id": "6.1",
              "description": "Discuss the need for low latency and fast processing in real-time applications. Analyze the computational demands of complex machine learning models.",
              "examples": [
                {
                  "reference": "Feng_W_2024",
                  "description": "Develops a real-time GUI for monitoring driver alertness, demonstrating the practical applicability of the model in real-time.",
                  "note": "Added for its development of a real-time GUI, showcasing the practical implementation of fatigue monitoring in real-time scenarios."
                },
                {
                  "reference": "Gu_T_2024",
                  "description": "Aims to develop a low-power model suitable for deployment in devices with limited power resources for real-time monitoring.",
                  "note": "Added for its focus on developing a low-power model for real-time monitoring, addressing the challenge of limited power resources in real-time applications."
                },
                {
                  "reference": "Houshmand_S_2021",
                  "description": "Focuses on real-time detection capabilities using single-feature computation directly from EEG signals.",
                  "note": "Added for its emphasis on real-time detection using single-feature computation, which is crucial for timely interventions in safety-critical applications."
                },
                {
                  "reference": "Hussein_R_2024",
                  "description": "Aims to develop a system capable of real-time fatigue detection to provide timely warnings.",
                  "note": "Added for its focus on developing a system for real-time fatigue detection, highlighting the importance of timely warnings in preventing accidents."
                },
                {
                  "reference": "Kartsch_V_2018",
                  "description": "Focuses on real-time monitoring of drowsiness in a wearable format with extended battery life.",
                  "note": "Added for its focus on real-time monitoring using wearable technology, which is essential for practical applications in fatigue detection."
                },
                {
                  "reference": "Ko_L_2020",
                  "description": "Aims for real-time drowsiness detection using a single EEG sensor, though the study itself is in a controlled setting.",
                  "note": "Added for its aim of real-time drowsiness detection using a single EEG sensor, although the real-world applicability needs further investigation."
                },
                {
                  "reference": "Lian_Z_2024",
                  "description": "Aims for real-time fatigue detection, though the immediate applicability in real-time is noted as a limitation.",
                  "note": "Added for its aim towards real-time fatigue detection, acknowledging the challenges in achieving immediate real-time applicability."
                },
                {
                  "reference": "Liu_Y_2016",
                  "description": "Focuses on real-time detection capabilities, though the study itself is based on simulated driving tasks.",
                  "note": "Added for its focus on real-time detection capabilities, although the study's reliance on simulated driving tasks raises questions about real-world applicability."
                },
                {
                  "reference": "Mehmood_I_2023",
                  "description": "Aims for real-time fatigue monitoring, though the current implementation requires further development for real-time application.",
                  "note": "Added for its aim towards real-time fatigue monitoring, highlighting the need for further development to achieve practical real-time application."
                },
                {
                  "reference": "Mohammedi_M_2023",
                  "description": "Proposes an IoT Cloud solution for real-time alerts, though the focus of the paper is on reviewing existing techniques.",
                  "note": "Added for its proposal of an IoT Cloud solution for real-time alerts, showcasing an innovative approach to real-time fatigue monitoring."
                },
                {
                  "reference": "Zhang_X_2017",
                  "description": "Aims for real-time monitoring using a wireless wearable EEG.",
                  "note": "Added for its aim of real-time monitoring using a wireless wearable EEG, demonstrating the feasibility of real-time fatigue detection in practical settings."
                },
                {
                  "reference": "Zhang_X_2023",
                  "description": "Suggests future work should focus on real-time application of the fatigue detection method.",
                  "note": "Added for its suggestion to focus on real-time application, emphasizing the importance of translating research findings into practical, real-time fatigue detection systems."
                },
                {
                  "reference": "Zorzos_I_2023",
                  "description": "Focuses on achieving low prediction times suitable for real-time applications.",
                  "note": "Added for its focus on low prediction times, which is crucial for the effectiveness of real-time fatigue detection systems."
                },
                {
                  "reference": "Zou_S_2020_1",
                  "description": "Aims for real-time detection, though the study itself is based on simulated driving.",
                  "note": "Added for its aim towards real-time detection, despite the study being based on simulated driving, highlighting the need for real-world validation."
                }
              ],
              "trend": "Focus on real-time processing and low latency for immediate feedback in safety-critical applications."
            },
            {
              "title": "Edge Computing for On-Device Processing",
              "section_id": "6.2",
              "description": "Introduce the concept of edge computing and its advantages for EEG-based systems.",
              "examples": [
                {
                  "reference": "Bencsik_B_2023",
                  "description": "Proposes an embedded feature selection algorithm, suggesting a move towards edge computing for efficient processing.",
                  "note": "Added for its proposal of an embedded feature selection algorithm, indicating a move towards edge computing for efficient processing in EEG-based systems."
                },
                {
                  "reference": "Nguyen_H_2023",
                  "description": "Utilizes on-device machine learning for real-time drowsiness detection.",
                  "note": "Added for its use of on-device machine learning, demonstrating the application of edge computing in real-time drowsiness detection."
                },
                {
                  "reference": "Nguyen_H_2023_1",
                  "description": "Employs on-chip processing for real-time drowsiness detection using tiny ML techniques.",
                  "note": "Added for its employment of on-chip processing, highlighting the use of tiny ML techniques for real-time drowsiness detection on edge devices."
                }
              ],
              "trend": "Shift towards on-device processing to reduce reliance on cloud connectivity, minimize latency, and enhance privacy."
            },
            {
              "title": "Model Optimization for Resource-Constrained Devices",
              "section_id": "6.3",
              "description": "Discuss techniques for model compression, quantization, and pruning to reduce model size and computational cost.",
              "examples": [
                {
                  "reference": "Feng_W_2024",
                  "description": "Optimizes channel selection and neural network parameters, including the use of a separable CNN, to minimize computational resource requirements.",
                  "note": "Added for its optimization of channel selection and neural network parameters, demonstrating a focus on minimizing computational resource requirements for real-time applications."
                },
                {
                  "reference": "Gao_D_2024_1",
                  "description": "Suggests improving computational efficiency through techniques like channel selection and graph sparsification as part of future work.",
                  "note": "Added for its suggestion of improving computational efficiency, indicating a direction towards optimizing models for resource-constrained devices."
                },
                {
                  "reference": "Hu_F_2024",
                  "description": "Includes selective kernel attention to reduce computational demands and a capsule network designed for improved learning with limited data, suggesting a focus on efficiency.",
                  "note": "Added for its inclusion of selective kernel attention and a capsule network, which are aimed at reducing computational demands and improving learning efficiency."
                },
                {
                  "reference": "Latreche_I_2025",
                  "description": "Aims to develop a system with reduced computational complexity suitable for real-time applications by optimizing preprocessing and neural network parameters.",
                  "note": "Added for its aim to reduce computational complexity through optimization, making it suitable for real-time, resource-constrained applications."
                },
                {
                  "reference": "Liu_H_2023",
                  "description": "Optimizes computational costs by utilizing a multi-semantic approach to graph convolution and incorporating channel and spatial attention mechanisms.",
                  "note": "Added for its optimization of computational costs, demonstrating a method for reducing resource demands in complex models."
                },
                {
                  "reference": "Zorzos_I_2023",
                  "description": "Employs a shallow CNN to minimize computational complexity, achieving fast prediction times suitable for real-time detection.",
                  "note": "Added for its use of a shallow CNN to minimize computational complexity, showcasing an approach to achieving fast prediction times suitable for real-time detection."
                }
              ],
              "trend": "Development of lightweight and efficient models suitable for deployment on wearable devices and in-vehicle systems."
            }
          ]
        }
      ]
    }
  ]
}


